<?php
/**
 * Created by PhpStorm.
 * User: wangzhen
 * Date: 2020/1/30
 * Time: 19:19
 */
/**
 * TN+驱散+2DPS+2治疗 10%
total*0.9-灭火*7-火抗1-火抗2-total*10%/(TN+5)*0.5-机器人-老八第一
/人数+1
 */


echo date('Y-m-d',strtotime('+1 month',strtotime('2020-01-30')));exit;

$field=[
    'name' => '儿童姓名',
    'birthday' => '出生日期',
    'gender' => '性别',
    'field54' => '新建地点',
    'field53' => '其他遗传代谢病',
    'field52' => '新生儿疾病筛查（耳聋基因筛查）',
    'field51' => '新生儿疾病筛查（甲低和苯丙酮尿症）',
    'field50' => '所在居委会',
    'field49' => '新生儿听力筛查',
    'field48' => '新生儿窒息',
    'field47' => '分娩方式',
    'field46' => '先天畸形',
//        'field45' => '胎数',
//        'field44' => '产伤',
    'field43' => '颅内出血',
    'field42' => '出生孕周',
    'field41' => '母孕期情况',
    'field40' => '助产机构名称',
    'field39' => '出院日期',
    'field38' => '母亲第几产',
    'field37' => '母亲第几胎',
    'field27' => '儿童身份证号',
    'field26' => '儿童疾病记录',
    'field25' => '新生儿访视状态',
    'field24' => '管理机构',
    'field23' => '建册机构',
    'field22' => '过敏史',
    'field21' => '高危儿童状态',
    'field20' => '残疾儿状态',
    'field19' => '先天性髋脱位状态',
    'field18' => '先天性心脏病状态',
    'field17' => '肥胖状态',
    'field16' => '营养不良状态',
    'field15' => '佝偻病状态',
    'field14' => '贫血状态',
    'field13' => '体弱儿状态',
    'field7' => '条形码',
    'field6' => '出生医学证明号',
    'field0' => '建册时间',
    'mother' => '母亲姓名',
    'mother_phone' => '母亲联系电话',
    'mother_id' => '母亲身份证号',
    'father' => '父亲姓名',
    'father_phone' => '父亲联系电话',
    'father_birthday' => '父亲生日',
    'state' => '居住状态',
    'address' => '户籍所在省（北京市）',
    'field34' => '父亲文化程度',
    'field33' => '父亲职业',
    'field30' => '母亲文化程度',
    'field29' => '母亲职业',
    'field28' => '母亲出生日期',
    'field12' => '联系人电话',
    'field11' => '联系人姓名',
    'field44' => '户籍所在省（北京市）',
    'field45' => '户籍地址区',
    'field1' => '户口',
    'fieldu46'=>'现住址地址',
    'fieldu47'=>'儿童所在段区',
    'fieldp47'=>'现住址详细',

];
$rs=['汇总来源','统计年度','表单生成日期','儿童管理机构名称','儿童管理机构所在区县','姓名','性别','出生日期','条形码','母亲姓名','母亲联系电话','父亲姓名','父亲联系电话','母孕期管理社区名称','母孕期管理社区所在区县','户口','户籍地址','现住址','建册时间','迁入时间','在册年龄组划分','体检完成情况','本年度统计起始年龄（岁）','本年度统计起始年龄（月）','本年度统计结束年龄（岁）','本年度统计结束年龄（月）','健康管理','系统管理','6个月内喂养情况','低体重','生长迟缓','消瘦','超重','肥胖','佝偻病分期','贫血检查','贫血分度','龋齿检查','患龋','矫治','患龋颗数','矫治颗数','视力检查','视力低常','先天性心脏病筛查阳性年龄（岁）','先天性心脏病筛查阳性年龄（月）','先天性心脏病筛查阳性年龄（天）','先天性心脏病','发育性髋关节发育不良筛查阳性年龄（岁）','发育性髋关节发育不良筛查阳性年龄（月）','发育性髋关节发育不良筛查阳性年龄（天）','发育性髋关节发育不良','听力筛查','听力损失新发','听力损失既往'];
var_dump(array_diff($field,$rs));

if(!array_diff($field,$rs) || (array_search('母亲姓名',$rs) && !array_search('母亲姓名',$rs))) {
    var_dump(array_diff($field,$rs));
}